# <center> CCT College Dublin </center>

## <center> Assessment Cover Page</center>

<p style="font-size:larger; text-align:center; color:red;"><em>
To be provided separately as a word doc for students to include with every submission
</em></p>

<br><br><br>
---

<span style="font-size:larger;">

**Module Title:**&nbspStatistical Techniques for Data Analysisa Preparation
**Assessment Title:**&nbsp;& Statistical Techniques p;David McQuaid
**Student Full Name:**&nbsp;&nbsp;&nbsp;Yumiko Maria Bejarano Azogue 
**Student Number:**&nbsp;&nbsp;&nbsp;2024144
**Assessment Due Date:**21st April 2024bsp;5th April 2024 23:59
**Date of Submission:*21st April 2024 2024bsp;&nbsp;5/04/2024
</span> 

<br><br><br>

---

#### Declaration 

```
By submitting this assessment, I confirm that I have read the CCT policy on Academic Misconduct and understand the implications of submitting work that is not my own or does not appropriately reference material taken from a third party or other source. I declare it to be my own work and that all material from third parties has been appropriately referenced. I further confirm that this work has not previously been submitted for assessment by myself or someone else in CCT College Dublin or any other higher education institution.
```
<br><br><br>

# Observing and describing data

## Characterisation of the data set:

In [1]:
#Libraries and summary
import pandas as pd
import numpy as np

In [5]:
# Import thi slibrary to suppress the warnings
import warnings
# The object 'warnings' is used to call the method 'filterwarnings' and ignore the warnings
warnings.filterwarnings('ignore')

In [21]:
# Loading the data into the data frame
df = pd.read_csv("DEA04.20240415011714.csv") # df=dataframe

In [22]:
# To display the top 5 rows
df.head()

,STATISTIC,Statistic Label,TLIST(A1),Year,C02199V02655,Sex,C02076V02508,Age Group,UNIT,VALUE
0,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,310,15 - 24 years,Euro,18900.0
1,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,320,15 years and over,Euro,45781.0
2,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,410,25 - 29 years,Euro,31135.0
3,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,445,30 - 39 years,Euro,44439.0
4,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,480,40 - 49 years,Euro,55690.0

In [23]:
# To display the bottom 5 rows
df.tail()

,STATISTIC,Statistic Label,TLIST(A1),Year,C02199V02655,Sex,C02076V02508,Age Group,UNIT,VALUE
499,DEA04C03,Percentage of Employments,2022,2022,2,Female,410,25 - 29 years,%,48.3
500,DEA04C03,Percentage of Employments,2022,2022,2,Female,445,30 - 39 years,%,47.4
501,DEA04C03,Percentage of Employments,2022,2022,2,Female,480,40 - 49 years,%,49.1
502,DEA04C03,Percentage of Employments,2022,2022,2,Female,520,50 - 59 years,%,49.8
503,DEA04C03,Percentage of Employments,2022,2022,2,Female,560,60 years and over,%,48.2

In [24]:
df.shape  # Dataset size (rows, columns)

(504, 10)

In [25]:
# Information about the dataframe
print("\nInformation about the dataframe:")
df.info()

Information about the dataframe:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 504 entries, 0 to 503
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   STATISTIC        504 non-null    object
 1   Statistic Label  504 non-null    object
 2   TLIST(A1)        504 non-null    int64
 3   Year             504 non-null    int64
 4   C02199V02655     504 non-null    int64
 5   Sex              504 non-null    object
 6   C02076V02508     504 non-null    int64
 7   Age Group        504 non-null    object
 8   UNIT             504 non-null    object
 9   VALUE            504 non-null    float64
dtypes: float64(1), int64(4), object(5)
memory usage: 39.5+ KB

In [27]:
df.nunique()

STATISTIC            3
Statistic Label      3
TLIST(A1)           12
Year                12
C02199V02655         2
Sex                  2
C02076V02508         7
Age Group            7
UNIT                 2
VALUE              390
dtype: int64

In [29]:
# Missing Values
df.isnull().values.any()

False

In [30]:
df.isnull().sum().sum()

0

In [37]:
df.describe(include=object).T

                count unique                   top freq
STATISTIC         504      3              DEA04C01  168
Statistic Label   504      3  Mean Annual Earnings  168
Sex               504      2                  Male  252
Age Group         504      7         15 - 24 years   72
UNIT              504      2                  Euro  336

In [36]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
TLIST(A1),504.0,2016.500000,3.455482,2011.0,2013.75,2016.5,2019.25,2022.0
Year,504.0,2016.500000,3.455482,2011.0,2013.75,2016.5,2019.25,2022.0
C02199V02655,504.0,1.500000,0.500497,1.0,1.00,1.5,2.00,2.0
C02076V02508,504.0,435.000000,88.283836,310.0,320.00,445.0,520.00,560.0
VALUE,504.0,24342.586706,19515.499556,44.8,51.10,29461.5,39312.75,67392.0

In [39]:
df['Statistic Label'].unique()

array(['Mean Annual Earnings', 'Median Annual Earnings',
       'Percentage of Employments'], dtype=object)

In [40]:
df['Sex'].unique()

array(['Male', 'Female'], dtype=object)

In [41]:
df['Age Group'].unique()

array(['15 - 24 years', '15 years and over', '25 - 29 years',
       '30 - 39 years', '40 - 49 years', '50 - 59 years',
       '60 years and over'], dtype=object)